In [1]:
%load_ext sql

In [2]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [3]:
%%sql
DROP table if exists Emp;
CREATE TABLE Emp(
[Group]  varchar(20),
[Sequence]  int );

 * sqlite:///./test.db
Done.
Done.

[]

In [6]:
%%sql
INSERT INTO Emp VALUES('A',1);
INSERT INTO Emp VALUES('A',2);
INSERT INTO Emp VALUES('A',3);
INSERT INTO Emp VALUES('A',5);
INSERT INTO Emp VALUES('A',6);
INSERT INTO Emp VALUES('A',8);
INSERT INTO Emp VALUES('A',9);
INSERT INTO Emp VALUES('B',11);
INSERT INTO Emp VALUES('C',1);
INSERT INTO Emp VALUES('C',2);
INSERT INTO Emp VALUES('C',3);

 * sqlite:///./test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%sql select * from Emp

 * sqlite:///./test.db
Done.

[('A', 1),
 ('A', 2),
 ('A', 3),
 ('A', 5),
 ('A', 6),
 ('A', 8),
 ('A', 9),
 ('B', 11),
 ('C', 1),
 ('C', 2),
 ('C', 3)]

Write SQl to display max and min values of continuous 'sequence' in each 'group'

In [19]:
%%sql 
select `Group`,max(sequence),min(sequence) from (
select `Group`,sequence,(sequence-rownum) as grp_split
from (
select *,row_number() over(partition by `group` order by sequence) rownum from Emp)x
)y group by `Group`,grp_split

 * sqlite:///./test.db
Done.

[('A', 3, 1), ('A', 6, 5), ('A', 9, 8), ('B', 11, 11), ('C', 3, 1)]